{
  "backend/main.mo": "Motoko actor defining the backend for a CA practice website, handling contact form submissions, admin-gated contact retrieval, notifications by category, and partner listings with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the Government Notifications & Circulars section, specifying the affected files (App.tsx and Navigation.tsx) and associated test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key details of each component, hook, and style file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color tokens including background, foreground, primary, accent, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'B R Bhandari & Co - Chartered Accountants' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that composes the full CA practice website layout, rendering Navigation, Hero, About, Partners, Services, GovernmentResources, TaxCalculators, LoanCalculators, WhyChooseUs, Contact, Footer, and Toaster — with the Notifications section removed.",
  "frontend/src/components/About.tsx": "About section component displaying firm history, mission, vision, ICAI registration, and highlight cards for experience, partners, success rate, and certification.",
  "frontend/src/components/Contact.tsx": "Contact section wrapper that renders ContactInfo and ContactForm side by side in a two-column responsive grid with a header.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with controlled inputs for name, email, phone, and message, client-side validation, backend submission via useSubmitContact, and toast notifications for success or error.",
  "frontend/src/components/ContactInfo.tsx": "Displays contact details (address, phone, email, business hours) for B R Bhandari & Co as a list of cards with icons and links, plus a professional consultation card.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with firm info, quick navigation links, social media icons, contact details, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/GovernmentResources.tsx": "Displays a grid of clickable cards linking to key Indian government and regulatory websites (tax, corporate, market, regulatory), each tagged with a color-coded category badge.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, gradient overlay, firm branding, tagline, description, and CTA buttons to scroll to the contact or services section.",
  "frontend/src/components/LoanCalculators.tsx": "Provides an EMI calculator that takes loan amount, interest rate, and tenure inputs, computes monthly EMI, total interest, and total repayment, and displays a breakdown with percentages.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar that highlights the active section on scroll, supports smooth-scroll to page sections, and includes a responsive mobile menu toggle.",
  "frontend/src/components/Notifications.tsx": "React component that fetches and displays government notifications/circulars in a responsive grid of cards, with category badges (color-coded by type), formatted dates, and loading skeletons.",
  "frontend/src/components/Partners.tsx": "React component that renders a grid of CA firm partner profile cards using static data, showing each partner's photo, name, designation, qualifications, specializations, and years of experience.",
  "frontend/src/components/Services.tsx": "React component that displays the firm's service offerings (audit, tax, accounting, company formation, consulting) as cards with icons, descriptions, features, deliverables, and benefits.",
  "frontend/src/components/TaxCalculators.tsx": "React component providing two interactive calculators: an Income Tax calculator using FY 2024-25 new regime slabs with 80C/80D deductions, and a GST calculator that splits tax into CGST and SGST.",
  "frontend/src/components/WhyChooseUs.tsx": "React component that renders a grid of six value proposition cards (personalized attention, expertise, technology, pricing, timeliness, support) with icons to highlight the firm's differentiators.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for backend actor interactions including submitting contacts, fetching contacts/notifications/partners, and getting contact counts.",
  "frontend/src/index.css": "Global CSS file configuring Tailwind base/components/utilities and defining OKLCH-based CSS custom properties for a light/dark emerald-green and amber color scheme.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH color variables, custom fonts, border radii, shadows, and animations for the CA practice website.",
  "project_state.json": "Tracks project metadata and feature state, currently recording a pending request to remove the Government Notifications & Circulars section from the website."
}