{
  "backend/main.mo": "Motoko actor defining the backend for a CA practice website, handling contact form submissions, notifications (with category filtering), and partner data, with admin-only access control for sensitive operations.",
  "feature_evidence.json": "Feature evidence report documenting two requirements: ensuring the Partners component static array contains exactly 5 entries, and capping backend-fetched partner data to 5 entries on the frontend.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and content of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'B R Bhandari & Co - Chartered Accountants' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Navigation, Hero, About, Partners, Services, Notifications, etc.) into the full CA practice website layout with a Toaster for notifications.",
  "frontend/src/components/About.tsx": "About section component displaying firm history, mission, vision, ICAI registration, and highlight cards for B R Bhandari & Co's 30+ years of experience and 5 expert partners.",
  "frontend/src/components/Contact.tsx": "Contact section wrapper that renders ContactInfo and ContactForm side by side in a two-column responsive grid layout.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with client-side validation for name, email, phone, and message fields, submitting data via the useSubmitContact hook and showing toast notifications on success or failure.",
  "frontend/src/components/ContactInfo.tsx": "Displays contact details (address, phone, email, business hours) for B R Bhandari & Co as a list of cards with icons and links, plus a professional consultation card.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with firm info, quick navigation links, social media icons, contact details, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/GovernmentResources.tsx": "Displays a grid of clickable cards linking to key Indian government and regulatory websites (tax, corporate, market, regulatory), each tagged with a color-coded category badge.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, gradient overlay, firm branding, tagline, description, and buttons to scroll to the contact or services section.",
  "frontend/src/components/LoanCalculators.tsx": "Provides an EMI calculator that takes loan amount, interest rate, and tenure inputs, computes monthly installment and total interest using the standard EMI formula, and displays a breakdown.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar that highlights the active section on scroll, supports smooth scrolling to page sections, and includes a collapsible mobile menu.",
  "frontend/src/components/Notifications.tsx": "React component that fetches and displays government notifications/circulars in a responsive grid of cards, with category badges color-coded by type (GST, Income Tax, SEBI, etc.) and skeleton loading states.",
  "frontend/src/components/Partners.tsx": "React component that renders a grid of CA firm partner profile cards using static data, showing each partner's photo, name, designation, specializations as badges, and years of experience.",
  "frontend/src/components/Services.tsx": "React component that displays the firm's service offerings (Audit, Tax, Accounting, Company Formation, Financial Consulting) as cards with icons, descriptions, features, deliverables, and benefits.",
  "frontend/src/components/TaxCalculators.tsx": "React component providing two interactive calculators: an Income Tax calculator using FY 2024-25 new regime slabs with 80C/80D deductions, and a GST calculator that splits tax into CGST and SGST.",
  "frontend/src/components/WhyChooseUs.tsx": "React component that renders a static grid of six value proposition cards (personalized attention, expertise, technology, pricing, timeliness, support) with icons for the CA firm's differentiators.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for backend interactions including submitting contacts, fetching contacts/notifications/partners, and getting contact counts via the actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for a light/dark color scheme (emerald green and amber) used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH color variables, custom fonts, border radii, shadows, and animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking existing features and a pending fix request (AR-1) to cap the partners list to exactly 5 entries in the Partners component."
}