{
  "backend/main.mo": "Motoko actor defining the backend for a CA practice website, with data types and CRUD operations for contacts, notifications (categorized by tax/finance topics), and partners stored in in-memory maps.",
  "feature_evidence.json": "Feature evidence report confirming that the uploaded UMB photo is stored as a static asset and displayed as a partner profile image in the Partners component.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and content of each frontend source file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, primary, accent, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'B R Bhandari & Co - Chartered Accountants' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that composes the full CA practice website by rendering all section components (Navigation, Hero, About, Partners, Services, Notifications, etc.) in order with a Toaster for notifications.",
  "frontend/src/components/About.tsx": "About section component displaying firm history, mission, vision, ICAI registration highlights, and four stat cards (30+ years, 5 partners, 100% success rate, ICAI certified) using shadcn Card components.",
  "frontend/src/components/Contact.tsx": "Contact section wrapper that renders ContactInfo and ContactForm side by side in a two-column responsive grid with a section header.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with name, email, phone, and message fields, client-side validation, backend submission via useSubmitContact hook, and toast notifications for success or error states.",
  "frontend/src/components/ContactInfo.tsx": "Displays contact details (address, phone, email, business hours) for B R Bhandari & Co as a list of cards with icons and links, plus a professional consultation card.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with firm info, quick navigation links, social media icons, and a copyright bar with a caffeine.ai attribution link.",
  "frontend/src/components/GovernmentResources.tsx": "Displays a grid of clickable cards linking to key Indian government and regulatory websites (tax, corporate, market, regulatory), each tagged with a color-coded category badge.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, gradient overlay, firm branding, tagline, and CTA buttons to scroll to the contact or services section.",
  "frontend/src/components/LoanCalculators.tsx": "Interactive EMI calculator section that takes loan amount, interest rate, and tenure inputs, computes monthly EMI and total interest using the standard formula, and displays a breakdown.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar that highlights the active section on scroll, supports smooth-scroll to all page sections, and includes a responsive mobile menu toggle.",
  "frontend/src/components/Notifications.tsx": "Displays a grid of government notifications/circulars fetched from the backend, with category badges (color-coded by type), formatted dates, and skeleton loading states.",
  "frontend/src/components/Partners.tsx": "Renders a partners section combining a static partner entry (B R Bhandari) with dynamically fetched backend partners, each shown as a card with photo, bio, and expertise badges.",
  "frontend/src/components/Services.tsx": "Defines and displays a static list of CA firm services (Audit, Tax, Accounting, Company Formation, Financial Consulting) as cards with icons, descriptions, features, deliverables, and benefits.",
  "frontend/src/components/TaxCalculators.tsx": "Provides two interactive calculators: an Income Tax calculator using FY 2024-25 new regime slabs with 80C/80D deductions, and a GST calculator that splits tax into CGST and SGST components.",
  "frontend/src/components/WhyChooseUs.tsx": "Renders a static grid of six value proposition cards (personalized attention, expertise, technology, pricing, timeliness, support) with icons to highlight the firm's differentiators.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated actor when an Internet Identity is present or an anonymous actor otherwise, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend canister interactions including submitting contacts, fetching contacts/notifications/partners, and getting contact counts.",
  "frontend/src/index.css": "Global CSS file configuring Tailwind base styles and defining a professional emerald green and warm amber OKLCH color scheme with light/dark mode CSS variables.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based color tokens, custom fonts, border radii, shadows, and animations for accordion and gradient effects.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a pending task to add an uploaded partner photo as a static asset and display it in the Partners component."
}