{
  "backend/main.mo": "Motoko actor defining the backend for a CA practice website, handling contact form submissions, notifications (with category filtering), and partner data, with admin-only access control for sensitive operations.",
  "feature_evidence.json": "Feature evidence report confirming that the Partners component was updated to correct the partner name spelling to 'Poonam Punamiya' in the static partners data array.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and content of each frontend source file in the project.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark mode design tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'B R Bhandari & Co - Chartered Accountants' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that composes the full CA practice website by rendering all section components in order, along with a Toaster for notifications.",
  "frontend/src/components/About.tsx": "About section component displaying firm history, mission, vision, ICAI registration, and highlight stats (30+ years, 5 partners, 100% success rate) using cards and icons.",
  "frontend/src/components/Contact.tsx": "Contact section wrapper that renders ContactInfo and ContactForm side by side in a two-column responsive grid layout.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with fields for name, email, phone, and message, including validation logic and backend submission via the useSubmitContact hook with toast feedback.",
  "frontend/src/components/ContactInfo.tsx": "Displays contact details (address, phone, email, business hours) for B R Bhandari & Co as a list of cards with icons and links, plus a professional consultation prompt card.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with firm info, quick navigation links, social media icons, contact details, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/GovernmentResources.tsx": "Displays a grid of clickable cards linking to key Indian government and regulatory websites (tax, corporate, market, regulatory), each tagged with a color-coded category badge.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, gradient overlay, firm branding, tagline, description, and CTA buttons to scroll to the contact or services section.",
  "frontend/src/components/LoanCalculators.tsx": "Provides an EMI calculator that takes loan amount, interest rate, and tenure inputs, computes monthly EMI, total interest, and total repayment, and displays a breakdown with percentage splits.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with scroll-aware active section highlighting, smooth-scroll links to all page sections, and a responsive mobile hamburger menu.",
  "frontend/src/components/Notifications.tsx": "React component that fetches and displays government notifications/circulars in a responsive grid, with category badges (color-coded by type), formatted dates, and skeleton loading states.",
  "frontend/src/components/Partners.tsx": "React component that renders firm partner profiles as cards with photos, designations, specialization badges, and experience years, using a static data array with optional backend data via useGetPartners.",
  "frontend/src/components/Services.tsx": "Static React component that displays a grid of CA firm service offerings (Audit, Tax, Accounting, etc.) with icons, descriptions, features, deliverables, and benefits using Card components.",
  "frontend/src/components/TaxCalculators.tsx": "Interactive React component providing an Income Tax calculator (FY 2024-25 new regime slabs with cess) and a GST calculator that splits tax into CGST/SGST components.",
  "frontend/src/components/WhyChooseUs.tsx": "Static React component rendering a grid of six value proposition cards (personalized attention, expertise, technology, pricing, timeliness, support) for the CA firm's marketing section.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actor interactions including submitting contacts, fetching contacts/notifications/partners, and getting contact counts.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for a light/dark color scheme themed around emerald green and warm amber.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH CSS variable-based colors, custom fonts, border radii, shadows, and animations for the CA practice website.",
  "project_state.json": "Project state metadata file tracking existing features and a pending fix request to correct a partner name to 'Poonam Punamiya' in the Partners component."
}