{
  "kind": "build_request",
  "title": "Limit partners list to exactly 5 entries",
  "projectName": "BR Bhandari & Co",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Partners component, ensure the static partners data array contains exactly 5 partner entries. Remove any partner entries beyond the 5th so that no more than 5 partner cards are ever rendered on the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "only 5 partner is there. Not more than 5 partner"
        ]
      },
      "acceptanceCriteria": [
        "The Partners section displays exactly 5 partner cards — no more, no less.",
        "No sixth or additional partner card is visible on the page.",
        "All 5 displayed partner cards show correct names, designations, and details."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If the backend partner data (fetched via useGetPartners) returns more than 5 partners, cap the rendered list to the first 5 entries on the frontend so the UI never shows more than 5 partners regardless of backend data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "only 5 partner is there. Not more than 5 partner"
        ]
      },
      "acceptanceCriteria": [
        "When backend returns more than 5 partners, only the first 5 are rendered.",
        "The partners section never shows more than 5 cards under any data condition."
      ]
    }
  ],
  "constraints": [
    "Do not change any partner details (names, designations, specializations) — only remove entries beyond the 5th.",
    "The About section stat '5 partners' must remain consistent with the displayed count."
  ],
  "nonGoals": [
    "Adding new partners or modifying existing partner profile information.",
    "Changing the visual design or layout of the Partners section.",
    "Backend schema or data model changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}