{
  "backend/main.mo": "Motoko actor defining backend data models (Contact, Notification, Partner) and CRUD operations for contacts, notifications (with category filtering), and partners, using Map storage and auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of the Government Resources section component and its integration into the main App.tsx layout with high confidence.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx, hooks, and all component files (Navigation, Hero, About, Services, Contact, Partners, Notifications, TaxCalculators, LoanCalculators, WhyChooseUs, GovernmentResources, Footer).",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'CA Practice Website'.",
  "frontend/src/App.tsx": "Main React app component rendering Navigation and all sections in order: Hero, About, Partners, Services, Notifications, GovernmentResources, TaxCalculators, LoanCalculators, WhyChooseUs, Contact, Footer, plus Toaster.",
  "frontend/src/components/About.tsx": "About section displaying firm history, mission, vision, ICAI registration details, and four highlight cards (30+ years experience, 5 partners, 100% success rate, ICAI certified) with icons.",
  "frontend/src/components/Contact.tsx": "Contact section wrapper rendering ContactInfo and ContactForm components in a two-column grid layout with section header.",
  "frontend/src/components/ContactForm.tsx": "Contact form with name, email, phone, message fields, validation logic, backend submission via useSubmitContact hook, loading states, and toast notifications for success/error feedback.",
  "frontend/src/components/ContactInfo.tsx": "Displays contact information cards (address, phone, email, business hours) with icons and links, plus a consultation call-to-action card.",
  "frontend/src/components/Footer.tsx": "Footer component with company info, quick navigation links, social media icons, contact details, and attribution to caffeine.ai.",
  "frontend/src/components/GovernmentResources.tsx": "Grid of government and regulatory website links (Income Tax, GST, MCA, SEBI, NSE, BSE, etc.) with categorized color-coded badges.",
  "frontend/src/components/Hero.tsx": "Hero section with background image overlay, company name, tagline, description, and CTA buttons to scroll to contact and services sections.",
  "frontend/src/components/LoanCalculators.tsx": "EMI calculator component with input fields for loan amount, interest rate, and tenure, displaying calculated EMI, total interest, and payment breakdown.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with scroll detection, active section highlighting, and responsive mobile menu for navigating between page sections.",
  "frontend/src/components/Notifications.tsx": "Displays government notifications and circulars with category badges and date formatting, fetching data via useGetAllNotifications hook. Includes loading skeletons and maps NotificationCategory enum to colored badges with labels.",
  "frontend/src/components/Partners.tsx": "Renders a grid of partner profiles with photos, bios, and expertise badges using data from useGetPartners hook. Shows loading skeletons while fetching partner information.",
  "frontend/src/components/Services.tsx": "Displays a comprehensive list of CA firm services including Audit, Tax, Accounting, Company Formation, and Financial Consulting with detailed descriptions, features, deliverables, and benefits. Each service card includes an icon, title, and expandable details.",
  "frontend/src/components/TaxCalculators.tsx": "Provides interactive calculators for Income Tax (FY 2024-25 New Regime with deductions) and GST (CGST/SGST split). Implements tax slab calculations and displays results with formatted currency values.",
  "frontend/src/components/WhyChooseUs.tsx": "Showcases six value propositions (Personalized Attention, Regulatory Expertise, Technology Integration, Transparent Pricing, Timely Delivery, Comprehensive Support) in a grid layout with icons and descriptions. Uses hover effects and accent borders for visual appeal.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including contact form submission, fetching contacts/notifications/partners, and contact count retrieval using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a professional emerald green and warm amber color scheme for both light and dark modes, plus gradient animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors using OKLCH color space, typography, animations (accordion, gradient-shift), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for a CA firm website (B R Bhandari & Co) including firm details, five partners' information, contact details, existing features list, and architectural notes about services and requirements."
}